docs/mfo/20240319195624-mfo_logica_temporal_das_acoes.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Personal homepage exported with org-thtml">

  <title>Introdução à Lógica Temporal das Ações</title>
  <link rel="icon" type="image/x-icon" href="/images/favicon.ico">

  <meta property="og:url" content="http://nowhere.org/mfo/20240319195624-mfo_logica_temporal_das_acoes.html" />
  <meta property="og:title" content="Introdução à Lógica Temporal das Ações" />
  <meta property="og:type" content="article" />
  <meta property="og:description" content="Personal homepage exported with org-thtml" />
  
  
    <meta name="twitter:card" content="summary_large_image">
    <meta name="twitter:site" content="@bugarela">
    <meta name="twitter:title" content="Introdução à Lógica Temporal das Ações">
    <meta name="twitter:description" content="Personal homepage exported with org-thtml">
  

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/pure-min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/grids-responsive-min.css">
<link rel="stylesheet" href="../css/layouts/style.css">

  </head>
  <body>
    <div id="layout" class="pure-g">
      <div class="sidebar pure-u-1 pure-u-md-1-3">
  <div class="pure-g">
    <div class="pure-u-1 pure-u-lg-1-2">
    </div>
    <div class="pure-u-1 pure-u-lg-1-2">
      <div class="header">
        <h2 class="brand-title"><a href="../"><i class="fas fa-home"></i> Gabriela Moreira</a></h2>
      </div>
      <div class="centered">
        <h1 class="huge"><i class="fas fa-folder-open"></i></h1>
        <h1 class="huge"><a href="./">MFO</a></h1>
        <h2 class="brand-title">Métodos Formais</h2>
        <h2 class="brand-tagline">Materiais da disciplina</h2>
      </div>
      <div class="footer">
  <div>Created using Emacs and <a href="https://github.com/juanjosegarciaripoll/org-thtml">org-mode</a></div>
</div>

    </div>
  </div>
</div>

      <div class="content pure-u-1 pure-u-md-2-3">
        <h2>Introdução à Lógica Temporal das Ações</h2>
        <a href="https://bugarela.com/mfo/slides/20240319195624-mfo_logica_temporal_das_acoes.pdf">Slides</a><br />
<a href="https://bugarela.com/mfo/specs/semaforos.zip">Specs</a>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcf0075a">1. Lógica Temporal das Ações (TLA)</a>
<ul>
<li><a href="#org73d67ff">1.1. Introdução</a></li>
<li><a href="#org44a2c84">1.2. Operador <i>primed</i></a></li>
<li><a href="#orgf8e79b8">1.3. Exemplos: operador <i>primed</i></a></li>
<li><a href="#org852edd5">1.4. Ações definem Transições</a></li>
<li><a href="#org47e6328">1.5. Uma fórmula temporal define o modelo!</a></li>
</ul>
</li>
<li><a href="#orgc1b3abd">2. TLA+ e Quint</a>
<ul>
<li><a href="#org5e0030e">2.1. TLA+ e Quint</a></li>
<li><a href="#orge56860c">2.2. TLC e Apalache</a></li>
<li><a href="#orgee4ebea">2.3. <i>Model checking</i> TLA+</a></li>
<li><a href="#orgc8b7276">2.4. <i>Model checking</i> Quint</a></li>
<li><a href="#org14fd4e0">2.5. Referências</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgcf0075a" class="outline-2">
<h2 id="orgcf0075a"><span class="section-number-2">1.</span> Lógica Temporal das Ações (TLA)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org73d67ff" class="outline-3">
<h3 id="org73d67ff"><span class="section-number-3">1.1.</span> Introdução</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A Lógica Temporal das Ações (<i>Temporal Logic of Actions</i> - TLA) foi proposta em (<a href="#citeproc_bib_item_1">LAMPORT, 1994</a>).<br />
</p>

<p>
Seu principal conceito são <b>ações</b>. Uma ação é uma expressão booleana composta de variáveis, variáveis <i>primed</i> e constantes.<br />
</p>

<p>
Nessa aula, vamos focar em como usar ações, com o operador <i>primed</i> (<code>'</code>), para definir estruturas de Kripke. Mais adiante, em outra aula, falaremos sobre outros conceitos.<br />
</p>
</div>
</div>
<div id="outline-container-org44a2c84" class="outline-3">
<h3 id="org44a2c84"><span class="section-number-3">1.2.</span> Operador <i>primed</i></h3>
<div class="outline-text-3" id="text-1-2">
<p>
\(f'\) (f <i>primed</i>) para uma função de estado \(f\) é o valor de \(f\) no <b>final de um passo</b>.<br />
</p>

<p>
Em outras palavras, para um passo composto por uma <b>dupla de estados</b> \((s, t)\), \(f'\) é o valor de \(f\) para \(t\).<br />
</p>

<p>
De forma semelhante, \(P'\) para um predicado \(P\) é o valor de \(P\) para o estado final de um passo. Assim, na avaliação da valoração de uma ação para um passo, predicados e variáveis <b>sem</b> o operador <i>primed</i> se referem aos seus respectivos valores no <b>primeiro estado</b> do passo, e sempre que <b>forem marcados</b> com o operador, fazem referência aos valores no <b>segundo</b> estado do passo.<br />
</p>
</div>
</div>
<div id="outline-container-orgf8e79b8" class="outline-3">
<h3 id="orgf8e79b8"><span class="section-number-3">1.3.</span> Exemplos: operador <i>primed</i></h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>\(x' = x + 1\)<br /></li>
<li>\(x + 1 = x'\)<br /></li>
<li>\(x = x' - 1\)<br /></li>
</ol>

<p>
Outros exemplos:<br />
</p>
<ul class="org-ul">
<li>\(x' > x\)<br /></li>
<li>\(x' /= x + 1\)<br /></li>
</ul>

<p>
PS: É necessário muito cuidado ao usar formas diferentes de (1).<br />
</p>
</div>
</div>
<div id="outline-container-org852edd5" class="outline-3">
<h3 id="org852edd5"><span class="section-number-3">1.4.</span> Ações definem Transições</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Combinando operações <i>primed</i> e predicados comuns, podemos definir as transições do modelo.<br />
</p>
<ul class="org-ul">
<li>Uma transição é permitida no modelo definido por uma ação sse a avaliação da ação pro passo da transição é verdadeiro.<br />
<ul class="org-ul">
<li>Exemplo:<br />
<ul class="org-ul">
<li>Ação \(x' = x + 1\)<br /></li>
<li>Transição \(1 \rightarrow 2\)<br /></li>
<li>Substituindo \(x\) por \(1\) e \(x'\) por \(2\), a igualdade é satisfeita<br /></li>
</ul></li>
</ul></li>
</ul>

<p>
Note que <b>1</b> ação define <b>N</b> transições. Assim, uma única ação pode definir todas as transições de um modelo!<br />
</p>
</div>
</div>
<div id="outline-container-org47e6328" class="outline-3">
<h3 id="org47e6328"><span class="section-number-3">1.5.</span> Uma fórmula temporal define o modelo!</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>Um predicado comum define o(s) estado(s) inicial(is).<br />
<ul class="org-ul">
<li>Geralmente, chamamos de \(Init\) ou <code>init</code>.<br /></li>
<li>Exemplo: \(Init \triangleq x = 0\)<br /></li>
</ul></li>
</ol>
<ol class="org-ol">
<li>Uma ação define as transições.<br />
<ul class="org-ul">
<li>Geralmente, chamamos de \(Next\) ou <code>step</code>.<br /></li>
<li>Exemplo: \(Next \triangleq x' = x + 1\)<br /></li>
</ul></li>
</ol>
<ol class="org-ol">
<li>Uma fórmula temporal define o modelo.<br />
<ul class="org-ul">
<li>\(Spec \triangleq Init \land \square Next\)<br /></li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc1b3abd" class="outline-2">
<h2 id="orgc1b3abd"><span class="section-number-2">2.</span> TLA+ e Quint</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5e0030e" class="outline-3">
<h3 id="org5e0030e"><span class="section-number-3">2.1.</span> TLA+ e Quint</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>TLA+ (<i>Temporal Logic of Actions+</i>) combina a lógica de TLA com teoria de conjuntos, definindo uma linguagem de especificação formal.<br /></li>
</ul>
<ul class="org-ul">
<li>Quint é uma syntaxe alternativa à TLA+, que pode ser transpilada para TLA+, e portanto pode usar as mesmas ferramentas.<br />
<ul class="org-ul">
<li>Quint tem alguns recursos adicionais que não existem em TLA+, com definições de testes e execuções (<i>runs</i>).<br /></li>
<li>Quint (ainda) não suporta algumas coisas de TLA+ que serão vistas no final da disciplina, como refinamento.<br /></li>
<li>No geral, Quint é <b>intencionalmente</b> mais restrito que TLA+.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge56860c" class="outline-3">
<h3 id="orge56860c"><span class="section-number-3">2.2.</span> TLC e Apalache</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Temos dois <i>model checkers</i> disponíveis para TLA+ e Quint.<br />
</p>
<ul class="org-ul">
<li>TLC<br />
<ul class="org-ul">
<li>Primeiro <i>model checker</i> para TLA+. Faz enumeração explícita de estados.<br /></li>
<li>Funciona apenas com TLA+, então especificações em Quint precisam ser transpiladas<br /></li>
<li>Open source, mantido pela Microsoft Research<br /></li>
</ul></li>
</ul>
<ul class="org-ul">
<li>Apalache<br />
<ul class="org-ul">
<li><i>Model checker</i> limitado simbólico. Traduz a especificação para restrições SMT e resolve-as usando o <i>solver</i> Z3.<br /></li>
<li>Exige anotações de tipo para variáveis e constantes<br /></li>
<li>Suporte nativo a TLA+ e Quint*<br /></li>
<li>Open source, desenvolvido e mantido pela Informal Systems<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgee4ebea" class="outline-3">
<h3 id="orgee4ebea"><span class="section-number-3">2.3.</span> <i>Model checking</i> TLA+</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Apalache<br />
<ul class="org-ul">
<li>Lembre-se de anotar os tipos<br /></li>
<li>Use a linha de comando<br /></li>
</ul></li>
</ol>
<ol class="org-ol">
<li>TLC<br />
<ul class="org-ul">
<li>Crie um arquivo <code>.cfg</code><br /></li>
<li>Use a linha de comando ou a extensão para VSCode<br /></li>
</ul></li>
</ol>
<ol class="org-ol">
<li>Toolbox (TLC)<br />
<ul class="org-ul">
<li>A IDE cria as configurações para você, porém você fica dependente da IDE para rodar o <i>model checker.</i><br /></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgc8b7276" class="outline-3">
<h3 id="orgc8b7276"><span class="section-number-3">2.4.</span> <i>Model checking</i> Quint</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Linha de comando: <code>quint verify spec.qnt</code><br />
<ul class="org-ul">
<li>Isso vai baixar e usar o Apalache por baixo<br /></li>
</ul></li>
</ol>
<ol class="org-ol">
<li>TLC: em breve, talvez.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org14fd4e0" class="outline-3">
<h3 id="org14fd4e0"><span class="section-number-3">2.5.</span> Referências</h3>
<div class="outline-text-3" id="text-2-5">
<div class="csl-bib-body">
  <div class="csl-entry"><a id="citeproc_bib_item_1"></a>LAMPORT, L. The temporal logic of actions. <b>ACM trans. program. lang. syst.</b>, v. 16, n. 3, p. 872–923, 1994. </div>
</div>
</div>
</div>
</div>

      </div>
    </div>
  </body>
</html>
